const jobsData = {
  "نائب مسؤول إدارة عائلة قمم": {
    family: "شواغر عائلة قمم ",
    title: "نائب مسؤول إدارة عائلة قمم",
    department: "إدارة عائلة قمم",
    questions: [
      {
        id: "lok",
        label: "كيف تقيم قدرتك على تمثيل المسؤول عند غيابه؟",
        type: "radio",
        Options: ["ضعيف", "متوسط", "جيد", "ممتاز"],
        required: true,
      },
      {
        id: 2,
        label:
          "إذا تلقيت توجيهات جديدة من المسؤول، ما هي الخطوة الأولى التي ستقوم بها لضمان التنفيذ السلس لها؟ ",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "كيف يمكنك التأكد من أن جميع المشاركين يحضرون الاجتماعات المقررة؟",
        type: "radio",
        Options: [
          " إرسال دعوات عبر البريد",
          "التأكيد المباشر مع الأعضاء",
          " اعتماد جدول زمني محدد",
          " جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 4,
        label:
          "ما هي العناصر الأساسية التي تركز عليها عند كتابة محاضر الاجتماعات؟  ",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف تقوم بمتابعة تنفيذ المهام الموزعة على مسؤولي الأقسام؟",
        type: "text",
        required: true,
      },
      {
        id: 6,
        label:
          "ما الطريقة التي تستخدمها لتنظيم الملفات والمستندات المهمة إلكترونيا؟",
        type: "text",
        required: true,
      },
      {
        id: 7,
        label: "ما هي الطريقة التي تفضلها لضمان استلام التقارير في مواعيدها؟",
        type: "radio",
        Options: [
          "إرسال تذكيرات",
          " تحديد مواعيد نهائية صارمة",
          "التواصل المباشر مع الأعضاء",
          " جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 8,
        label: "كيف تستقبل شكاوى الأعضاء وكيف تتعامل معها؟  ",
        type: "textarea",
        required: true,
      },
      {
        id: 9,
        label: "كيف تقوم على حل النزاعات الإدارية بين الأعضاء؟",
        type: "text",
        required: true,
      },
      {
        id: 10,
        label: "كيف تصف مستوى مهاراتك في الكتابة باللغة العربية والإنجليزية؟",
        type: "text",
        required: true,
      },
      {
        id: 11,
        label: "كيف تعمل على تحفيز الأعضاء وتشجيعهم على العمل؟",
        type: "text",
        required: true,
      },
      {
        id: 12,
        label: "إضافه او تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "مسؤول/ نائب مسؤول قسم القيم والثقافة": {
    family: "شواغر عائلة قمم ",
    title: " مسؤول / نائب مسؤول قسم القيم والثقافة",
    department: "إدارة عائلة قمم",
    questions: [
      {
        id: 1,
        label: "كيف تصف مهاراتك في التخطيط والتنظيم؟",
        type: "text",
        required: true,
      },
      {
        id: 2,
        label: "ما هي تجربتك السابقة في إدارة الفرق أو الأقسام؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "كيف تتعامل مع المشكلات الطارئة؟",
        type: "text",
        required: true,
      },
      {
        id: 4,
        label: "ما هي القيم التي تعتقد أنها مهمة لتحقيق رؤية قمم؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "ما هي القيم التي تعتقد أنها مهمة لتحقيق رؤية قمم؟ ",
        type: "radio",
        Options: ["التعاون", "الابتكار", "المسؤولية", "الاحترام"],
        required: true,
      },
      {
        id: 6,
        label: "كيف تقيم قدرتك على التنسيق مع المتاجر لجوائز الفائزين؟",
        type: "radio",
        Options: ["ضعيف", "متوسط", "جيد", "ممتاز"],
        required: true,
      },
      {
        id: 7,
        label: "كيف يمكنك ضمان تسليم الجوائز في الوقت المحدد؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label: "كيف تقيم مهاراتك في هذا مجال كتابة المحتوى؟",
        type: "radio",
        Options: ["ضعيف", "متوسط", "جيد", "ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "هل لديك أمثلة على محتوى قمت بكتابته في السابق؟",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label:
          "كيف ستقوم بتنظيم فعالية معينة من البداية حتى النهاية وماهي خطواتك لضمان نجاح الفعالية من حيث التحضير والتنظيم؟",
        type: "textarea",
        required: true,
      },
      {
        id: 11,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "عضو قسم القيم والثقافة": {
    family: "شواغر عائلة قمم ",
    title: " عضو قسم القيم والثقافة",
    department: "إدارة عائلة قمم",
    questions: [
      {
        id: 1,
        label: "كيف تقيم مهاراتك في كتابة المحتوى؟",
        type: "radio",
        Options: ["ضعيف", "متوسط", "جيد", "ممتاز"],
        required: true,
      },
      {
        id: 2,
        label: "هل لديك تجارب سابقة في كتابة محتوى للقيم أو المواضيع الثقافية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "اختر الموضوع الذي تعتقد أنك تستطيع الكتابة عنه بشكل جيد:",
        type: "radio",
        Options: [
          "القيم الإسلامية",
          "بناء الفرق",
          "التحفيز الشخصي",
          "فنون الحياة",
        ],
        required: true,
      },
      {
        id: 4,
        label:
          "كيف ستقوم بتنظيم فعالية معينة من البداية حتى النهاية وماهي خطواتك لضمان نجاح الفعالية من حيث التحضير والتنظيم؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "هل لديك خبرة سابقة في تنظيم الفعاليات؟",
        type: "radio",
        Options: ["نعم", "لا"],
        required: true,
      },
      {
        id: 6,
        label: "كيف تقيم معرفتك أدوات إدارة الملفات مثل Google Drive؟",
        type: "radio",
        Options: ["ضعيف", "متوسط", "جيد", "ممتاز"],
        required: true,
      },
      {
        id: 7,
        label: "ما هي الطريقة التي تتبعها لضمان تنظيم الملفات بشكل فعال؟",
        type: "radio",
        Options: [
          "استخدام مجلدات ومجموعات",
          "تسمية الملفات بطريقة واضحة",
          "رفع الملفات بشكل دوري",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 8,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 9,
        label: "ما هي الطريقة التي تتبعها لتحديد فكرة مناسبة لمسابقة جديدة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label: "كيف يمكنك تعزيز مشاركة الأعضاء في المسابقات؟",
        type: "radio",
        Options: [
          "تقديم جوائز",
          "تنظيم حملات ترويجية",
          "تطوير محتوى جذاب",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 11,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 12,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "عضو في قسم شؤون شواغر قمم": {
    family: "شواغر عائلة قمم ",
    title: "عضو في قسم شؤون سواعد قمم",
    department: "إدارة عائلة قمم",
    questions: [
      {
        id: 1,
        label: "كيف تقيم مهاراتك في تنظيم البيانات وأرشفتها؟",
        type: "radio",
        Options: [" ضعيف", " متوسط", " جيد", " ممتاز"],
        required: true,
      },
      {
        id: 2,
        label: "ما هي الأدوات التي تستخدمها لإدارة البيانات؟",
        type: "radio",
        Options: [
          "Google Drive",
          "Microsoft Excel",
          "أدوات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 3,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 4,
        label: "كيف تضمن تحديث ملفات المتابعة والتقييم بشكل دوري؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف ستتعامل مع استفسارات الأعضاء لضمان حلها بسرعة؟",
        type: "radio",
        Options: [
          "الرد الفوري",
          "توجيههم إلى الشخص المعني",
          "توفير معلومات مفيدة مسبقاً",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 6,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 7,
        label: "هل لديك خبرة سابقة في العمل ضمن فريق؟",
        type: "radio",
        Options: ["نعم", "لا"],
        required: true,
      },
      {
        id: 8,
        label: "كيف تتعامل مع اللوائح التنظيمية في بيئة العمل؟",
        type: "radio",
        Options: [
          "أتبع التعليمات بدقة",
          "أعمل مع الفريق لضمان الالتزام",
          "أبحث عن طرق لتحسين العمليات",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 9,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 10,
        label: "اختر الطريقة التي تفضل استخدامها لإعداد الشهادات الرسمية:",
        type: "radio",
        Options: [
          "استخدام قوالب جاهزة",
          "تصميم الشهادات من الصفر",
          "الاشتراك في برنامج تصميم",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 11,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 12,
        label: "كيف تساهم في تصميم وتنفيذ فعالية مجتمعية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 13,
        label:
          "ما هي الخطوات التي ستتبعها لتوثيق وتقييم الفعاليات بعد تنفيذها؟",
        type: "radio",
        Options: [
          "جمع الملاحظات من المشاركين",
          "إعداد تقارير مفصلة",
          "تنظيم اجتماع لمناقشة النتائج",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 14,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 15,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "منسق عام في قسم التدريب والتطوير": {
    family: "شواغر عائلة قمم ",
    title: "منسق عام في قسم التدريب والتطوير",
    department: "إدارة عائلة قمم",
    questions: [
      {
        id: 1,
        label: "كيف تقيم مهاراتك في التواصل مع الآخرين؟",
        type: "radio",
        Options: [" ضعيف", " متوسط", " جيد", " ممتاز"],
        required: true,
      },
      {
        id: 2,
        label:
          "ما هي الطريقة التي تتبعها للتأكد من فهم احتياجات المدرب قبل بدء الورشة؟",
        type: "radio",
        Options: [
          "إجراء مقابلة مباشرة",
          "إرسال استبيان",
          "التواصل عبر البريد الإلكتروني",
          "خيارات أخرى (يرجى التوضيح)",
        ],
        required: true,
      },
      {
        id: 3,
        label: "في حالة اختيارك لخيارات اخرئ قم بتوضيحها هنا",
        type: "text",
        required: false,
      },
      {
        id: 4,
        label: "هل لديك تجربة سابقة في التنسيق مع المدربين؟",
        type: "radio",
        Options: ["نعم", "لا"],
        required: true,
      },
      {
        id: 5,
        label:
          "ما هي الخطوات التي تتبعها لضمان سير الورشة أو الفعالية وفق الجدول الزمني المحدد؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "كيف تتعامل مع التحديات أو التأخيرات التي قد تحدث أثناء الفعالية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "كيف تقوم بتقييم الأنشطة بعد انتهاء الفعالية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label: "كيف تقوم بكتابة التقارير؟",
        type: "textarea",
        required: true,
      },
      {
        id: 9,
        label: "كيف تساعد أعضاء الفريق عند الحاجة في تنفيذ المهام؟",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label:
          "ما هي الصفات التي تعتقد أنها مهمة لمنسق في قسم التدريب والتطوير؟",
        type: "textarea",
        required: true,
      },
      {
        id: 11,
        label: "كيف ستظهر روح المبادرة في عملك كمنسق؟",
        type: "textarea",
        required: true,
      },
      {
        id: 12,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  //////////////////////  2 //////////////

  "عضو الإشراف": {
    title: "عضو الإشراف",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "ما الخطوات التي تتبعها عادةً لتنظيم ومتابعة المهام بين الأقسام المختلفة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "كيف تضمن سهولة الوصول إلى الملفات من قبل الفريق مع الحفاظ على الأمان والسرية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "هل واجهت من قبل مشكلة في فقدان أو تكرار ملفات؟ كيف تعاملت معها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "عند إعداد تقرير دوري للإدارة، ما العناصر الأساسية التي تحرص على تضمينها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label:
          "إذا لاحظت انخفاضًا في أداء أحد الأقسام، ما الخطوات التي ستتخذها قبل رفع التقرير؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "ما الإجراءات التي تتبعها لتفادي الأخطاء عند إدخال أو أرشفة المعلومات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "إدارة الوقت",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 8,
        label: "حل المشكلات والأزمات",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "العمل الجماعي",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "التحليل واكتشاف الأخطاء",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 11,
        label: "التطوير والتحسين",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 12,
        label: "Microsoft Office",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 13,
        label: "Google Workspace",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
    ],
  },

  "مسؤول قسم المحتوى الأكاديمي": {
    title: "مسؤول قسم المحتوى الأكاديمي",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "هل لديك خبرة في الإشراف أو إنتاج محتوى أكاديمي؟ إذا كانت الإجابة نعم الرجاء ذكر تجربتك وطبيعة عملك",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label: "اقترح إستراتيجية لتطوير جودة المحتوى الأكاديمي داخل المنصة",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "هل لديك تجربة في التعامل مع المنهج السوداني للمرحلة الثانوية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label: "كيف تتأكد من موافقة المحتوى مع المنهج السوداني؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "مراجعة وضبط المحتوى الأكاديمي",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 6,
        label: "إعداد التقارير والخطط التشغيلية",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 7,
        label: "المهارات الإدارية ومتابعة الفريق",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 8,
        label: "Google Workspace or Microsoft Office",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "تعاملك مع المنهج السوداني",
        type: "radio",
        Options: ["طالب", "مدرس"],
        required: true,
      },
    ],
  },

  "مسؤول قواعد البيانات": {
    title: "مسؤول قواعد البيانات:",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "هل لديك خبرة في تنظيم أو إدارة قاعدة بيانات؟ الرجاء ذكرها بالسنوات أو الشهور",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label: "إذا كانت الإجابة نعم صف تجربتك وما الأدوات التي استخدمتها",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "كيف تضمن دقة البيانات عند إدخال أو تحديث معلومات كبيرة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "صِف موقفًا واجهت فيه خطأ أو مشكلة في قاعدة بيانات وكيف قمت بحلها",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label:
          "كيف تقوم بتحليل بيانات الطلاب أو المحتوى لاستخراج مؤشرات الأداء التي تساعد الفرق الأخرى على اتخاذ القرار؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "اقترح طريقة لتحسين تنظيم قاعدة البيانات أو طريقة إعداد التقارير الدورية لضمان سهولة الوصول إليها واستخدامها بكفاءة",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label:
          "ما مدى إلمامك بـ لغة SQL للاستعلام عن البيانات وإنشاء قواعد البيانات البسيطة",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label:
          "كيف تنظم البيانات بطريقة يسهل الوصول إليها واستخدامها عند الحاجة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 9,
        label: "كيف تتعامل مع البيانات الكبيرة دون فقدان الدقة أو التنظيم؟",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label: "دقة إدخال البيانات وتحديثها",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 11,
        label: "إعداد التقارير",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 12,
        label: "تحليل البيانات واستخلاص مؤشرات الأداء",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 13,
        label: "Google Sheets or Excel",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 14,
        label: "Power BI",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 15,
        label: "Python",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
    ],
  },

  "محلل البيانات": {
    title: "محلل البيانات",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "هل لديك خبرة سابقة في تحليل البيانات؟ الرجاء ذكرها بالسنوات أو الشهور",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "إذا كانت الإجابة نعم اذكر طبيعة عملك وما الأدوات التي استخدمتها",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "كيف تضمن دقة البيانات عند جمعها وإدخالها وتحليلها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "كيف تقدم نتائج تحليل البيانات بطريقة سهلة الفهم للفرق الأكاديمية أو الإدارية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف تتعامل مع البيانات المعقدة والكبيرة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label: "إلمامك بالمفاهيم الأساسية للإحصاء وتحليل البيانات",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 7,
        label: "القدرة على تفسير البيانات وعرض النتائج بطريقة مفهومة",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 8,
        label: "إعداد تقارير تحليلية دورية تساعد على تحسين الأداء",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "العمل الجماعي والتعاون",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "Google Sheets or Excel",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
    ],
  },

  "مسؤول / نائب مسؤول قسم المشاريع": {
    title: "مسؤول / نائب مسؤول قسم المشاريع",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label: "اذكر مثال لمشروع قمت باقتراحه والإشراف على تنفيذه",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "صِف تجربة سابقة لك في متابعة مشروع أو فريق، وكيف ساهمت في تحقيق أهدافه",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "كيف تتعامل مع تأخير أو مشاكل مفاجئة في تنفيذ المشروع؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "اقترح طريقة لتحسين آلية متابعة المشاريع وضمان جودة تنفيذ الخطط داخل الفريق",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف تقوم بإعداد تقارير واضحة ومفهومة للمسؤولين والجهات العليا؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label: "كيف تراقب جودة المخرجات والتأكد من الالتزام بالمعايير؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "تنظيم الوقت وإدارة الأولويات",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 8,
        label: "التنسيق مع الفرق المختلفة",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "مهارة القيادة",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "حل المشكلات والأزمات",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 11,
        label: "التفكير الإبداعي",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 12,
        label: "العمل الجماعي والتعاون",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 13,
        label: "Google Workspace or Microsoft Office",
        type: "radio",
        Options: ["ضعيف", "مقبول", "جيد", "جيد جداً", "ممتاز"],
        required: true,
      },
      {
        id: 14,
        label: "التعامل مع الخطط التشغيلية وإعدادها وتحديثها",
        type: "radio",
        Options: [
          "لدي خبرة في ذلك وقمت بذلك من قبل",
          "ليس لدي خبرة ولم أتعامل مع ذلك",
          "أخرى",
        ],
        required: true,
      },
    ],
  },

  "عضو قسم المشاريع": {
    title: "عضو قسم المشاريع",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label: "كيف تتعامل مع تأخير أو صعوبة في إتمام مهمة محددة ضمن المشروع؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "كيف تقدم الاقتراحات لتطوير أداء المشروع أو الفريق بطريقة فعّالة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "صِف موقفًا واجهت فيه تحديًا أثناء العمل ضمن الفريق، وكيف تعاملت معه للحفاظ على سير المشروع",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "اقترح طريقة لتعزيز التعاون بين أعضاء الفريق وضمان تنفيذ المهام بدقة وفي الوقت المحدد",
        type: "textarea",
        required: true,
      },
    ],
  },

  "عضو البرامج الميدانية": {
    title: "عضو البرامج الميدانية",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "هل لديك تجربة سابقة في تنفيذ برنامج ميداني، وما كانت مساهمتك الأساسية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label: "كيف تتعامل مع مشكلة ميدانية أو عائق أثناء تنفيذ النشاط؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "كيف تقوم بجمع البيانات والتقارير الميدانية بطريقة دقيقة وفعّالة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "صِف موقفًا عملت فيه ضمن فريق ميداني وتعاونت مع الآخرين لضمان نجاح البرنامج",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label:
          "اقترح طريقة لتحسين تنظيم وتنفيذ الأنشطة الميدانية لضمان تجربة أفضل للمستفيدين",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "ما هي خبرتك في الدعم اللوجستي وتنظيم المواقع الميدانية قبل التنفيذ؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "كيف تقوم بجمع البيانات والتقارير وتوثيق الصور؟",
        type: "textarea",
        required: true,
      },
    ],
  },

  "مسؤول / نائب مسؤول قسم المجتمع": {
    title: "مسؤول / نائب مسؤول قسم المجتمع",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "صف تجربة سابقة لك في إدارة مجتمع أو مبادرة طلابية، وما كانت مساهمتك الأساسية",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "كيف تقوم بتحفيز الأعضاء على المشاركة الفعّالة في الأنشطة والمبادرات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "كيف تقوم بمتابعة المشاركات والتفاعل اليومي للأعضاء داخل مجتمع قمم؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "كيف تقوم بتنسيق الأنشطة والفعاليات بين أعضاء الفريق لضمان نجاحها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف تتعامل مع قلة التفاعل أو المشاركة من الأعضاء داخل المنصة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "كيف ستتعامل مع المشكلات اليومية والطارئة أثناء الأنشطة والنقاشات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label:
          "كيف تقوم بجمع الملاحظات من الأعضاء وتحويلها إلى أفكار قابلة للتنفيذ لتحسين البرامج؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label:
          "كيف تقيم نتائج المبادرات داخل مجتمع قمم والاستفادة منها لتطوير البرامج؟",
        type: "textarea",
        required: true,
      },
      {
        id: 9,
        label:
          "اقترح طريقة لتطوير مجتمع قمم وتحسين تجربة الأعضاء وزيادة تفاعلهم",
        type: "textarea",
        required: true,
      },
    ],
  },

  "عضو قسم المجتمع": {
    title: "عضو قسم المجتمع",
    department: "إدارة البرامج العامة ",
    questions: [
      {
        id: 1,
        label:
          "هل لديك خبرة في التعامل مع النشاطات والمجتمعات الطلابية؟ إذا كانت الإجابة نعم الرجاء ذكر مهامك ودورك الذي قمت به؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label: "كيف تشجع الطلاب أو الأعضاء على المشاركة في الأنشطة والفعاليات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "كيف تقوم بمساعدة الفريق في تنظيم الفعاليات وضمان سيرها بسلاسة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label:
          "اقترح طريقة لتحسين التفاعل داخل مجتمع قمم وتجربة الأعضاء داخل المنصة.",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label:
          "هل تستطيع الالتزام بتنفيذ والمشاركة في المبادرات التي سينظمها مجتمع قمم؟ ",
        type: "radio",
        Options: [
          "نعم استطيع الالتزام دائما",
          "لا أستطيع الالتزام",
          "نعم مع بعض المرونة",
        ],
      },
    ],
  },

  //////////////////////////     3   ///////////////

  "عضو النشر": {
    title: "عضو قسم النشر",
    department: "إدارة الإعلام والتسويق",
    questions: [
      {
        id: 1,
        label: "ما الذي يجعلك مناسباً لهذا الدور في قسم النشر؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label:
          "هل لديك خبرة سابقة في مجال النشر؟ إذا كانت الإجابة نعم الرجاء ذكرها بالتفصيل.",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "المنصات التي لديك خبرة في إدارتها أو التعامل معها",
        type: "checkbox",
        Options: [
          "فيسبوك",
          "انستغرام",
          "تويتر (X)",
          "تيك توك",
          "لينكد إن",
          "أخرى",
        ],
        required: true,
      },
      {
        id: 4,
        label: "ما مستوى خبرتك في إدارة أو النشر على وسائل التواصل الاجتماعي؟",
        type: "radio",
        Options: ["مبتدئ", "متوسط", "متقدم"],
        required: true,
      },
      {
        id: 5,
        label: "كيف تتعامل عادةً مع التعليقات أو الرسائل السلبية على المنصات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label: "ما الخطوات التي تتبعها لضمان نشر المحتوى بشكل جيد وجذاب؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "هل يمكنك الالتزام بالتفاعل المستمر مع المتابعين خلال اليوم؟",
        type: "radio",
        Options: ["نعم", "لا"],
        required: true,
      },
      {
        id: 8,
        label: "هل سبق أن أدرت حساباً أو نشرت محتوى على صفحة عامة؟ صف التجربة.",
        type: "textarea",
        required: true,
      },
    ],
  },

  "كاتب محتوى": {
    title: "كاتب محتوى",
    department: "إدارة الإعلام والتسويق",
    questions: [
      {
        id: 1,
        label: "ما الذي يجعلك مناسباً لهذا الدور في فريق الإعلام؟",
        type: "textarea",
        required: true,
      },
      {
        id: 2,
        label: "ما مستوى خبرتك في كتابة المحتوى؟",
        type: "radio",
        Options: ["مبتدئ", "متوسط", "متقدم"],
        required: true,
      },
      {
        id: 3,
        label: "ما نوع المحتوى الذي كتبته من قبل (إن وجد)؟",
        type: "radio",
        Options: [
          "منشورات لمنصات التواصل الاجتماعي",
          "مقالات أو مدونات",
          "نصوص تسويقية أو دعائية",
          "لم أكتب من قبل لكن أرغب في التعلم",
        ],
        required: true,
      },
      {
        id: 4,
        label: "كيف تبحث عادةً عن أفكار جديدة ومبتكرة للمحتوى؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label:
          "عند تكليفك بكتابة منشور، ما الخطوات التي تتبعها قبل البدء بالكتابة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "ما رأيك في العمل الجماعي؟ كيف تتعامل مع الملاحظات أو التعديلات على كتاباتك؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label: "ما مدى التزامك بأداء المهام وتسليمها في وقتها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label:
          "ما مدى استعدادك لتعلم أساليب جديدة في كتابة المحتوى وتطوير مهاراتك؟",
        type: "radio",
        Options: ["1 - غير مستعد", "2", "3", "4", "5 - مستعد جداً"],
        required: true,
      },
      {
        id: 9,
        label: "هل سبق أن عملت ضمن فريق كتابة أو مشروع إعلامي؟ صف التجربة.",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label: "نموذج من أعمالك",
        type: "textarea",
        required: false,
      },
    ],
  },

  ممنتج: {
    title: "منتج في قسم التصميم والمونتاج",
    department: "إدارة الإعلام والتسويق",
    questions: [
      {
        id: 1,
        label: "ما البرامج التي تتقن استخدامها في المونتاج؟",
        type: "checkbox",
        Options: ["Adobe Premiere", "After Effects", "CapCut", "Other"],
        required: true,
      },
      {
        id: 2,
        label: "ما مستوى خبرتك في المونتاج؟",
        type: "radio",
        Options: ["مبتدئ", "متوسط", "متقدم"],
        required: true,
      },
      {
        id: 3,
        label: "هل سبق أن عملت على فيديوهات ترويجية أو تعليمية؟ صف خبرتك",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label: "كيف تتأكد من التزامك بالهوية البصرية أثناء عملك على الفيديو؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "ما الذي يلهمك أثناء العمل على منتج فيديو جديد؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label:
          "ما مدى التزامك بالمواعيد النهائية المحددة لتسليم الأعمال في الوقت المحدد؟",
        type: "textarea",
        required: true,
      },
      {
        id: 7,
        label:
          "ما مدى استعدادك لتعلم أدوات جديدة أو تطوير مهاراتك في المونتاج؟",
        type: "radio",
        Options: ["1 - غير مستعد", "2", "3", "4", "5 - مستعد جداً"],
        required: true,
      },
      {
        id: 8,
        label: "أرفق نموذجاً لأحد أعمالك السابقة (إن وجد)",
        type: "textarea",
        required: false,
      },
      {
        id: 9,
        label: "ما الذي يجعلك مناسباً لهذا الدور في منصة قمم؟",
        type: "textarea",
        required: true,
      },
    ],
  },

  //////////////////////////    4   //////////////////////

  "نائب مسؤول قسم المصروفات": {
    title: "نائب مسؤول قسم المصروفات",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label: "ما هو مؤهلك الأكاديمي في مجال المحاسبة أو المالية؟",
        type: "radio",
        Options: [
          "بكالاريوس",
          "ماجستير",
          "شهادة مهنية (مثل CPA، CMA)",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 2,
        label: "يرجى وصف خبرتك السابقة في مجال المحاسبة أو الإدارة المالية",
        type: "text",
        required: true,
      },
      {
        id: 3,
        label:
          "كيف تقيم قدرتك على ضمان التزام الأعضاء بالإجراءات والسياسات المالية المعتمدة؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 4,
        label:
          "أي من الأدوات الرقمية التالية تستخدمها لحفظ وأرشفة المستندات؟ (يمكن اختيار أكثر من خيار)",
        type: "checkbox",
        Options: [
          "Microsoft Excel",
          "Google Sheets",
          "QuickBooks",
          "ERP Systems (مثل SAP، Oracle)",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 5,
        label: "كيف تتعامل مع الأخطاء أو المخالفات المالية عند اكتشافها؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6,
        label: "ما هي خبرتك في إعداد تقارير مالية دورية؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 7,
        label: "كيف تعتقد أنه يمكنك تحسين التنسيق مع عدة جهات في وقت واحد؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label:
          "كيف تقيم قدرتك على التعامل مع المواعيد النهائية الضيقة والمشاريع المتعددة؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 9,
        label: "كيف تقيم مهاراتك في تنظيم الملفات والمتابعة؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 10,
        label:
          "ما هو المجال الذي ترغب في تطوير مهاراتك فيه لأداء أفضل في هذا الدور؟",
        type: "radio",
        Options: [
          "الإدارة المالية",
          "استخدام الأدوات الرقمية",
          "تحليل البيانات",
        ],
        required: true,
      },
      {
        id: 11,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "مسؤول قسم الإيرادات": {
    title: "مسؤول قسم الإيرادات",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label: "ما هو تخصصك الأكاديمي؟",
        type: "radio",
        Options: ["محاسبة", "إدارة مالية", "اقتصاد", "أخرى (يرجى التحديد)"],
        required: true,
      },
      {
        id: 2,
        label: "كيف تقيم خبرتك العملية في إدارة الإيرادات:",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 3,
        label: "ما الخطوات التي تتبعها لمراجعة واعتماد الإيصالات المالية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 4,
        label: "كيف يمكنك التأكد من توريد جميع الإيرادات للحساب الرسمي للمنصة؟",
        type: "radio",
        Options: [
          "بواسطة مراجعة أسبوعية",
          "إعداد تقارير شهرية",
          "التواصل مع الفرق المعنية",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 5,
        label:
          "كيف تقيم مهاراتك في التنسيق مع قسم التسجيل لضمان ربط الإيرادات بالطلاب والمستفيدين؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 6,
        label:
          "ما هي العناصر الأساسية التي تركز عليها عند إعداد تقارير الإيرادات؟",
        type: "radio",
        Options: [
          "حجم الإيرادات",
          "توزيع الإيرادات",
          "التوصيات للمستقبل",
          "جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 7,
        label: "كيف تقيم مهاراتك في التحليل المالي:",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 8,
        label:
          "هل لديك خبرة في استخدام الأدوات الرقمية للتعامل مع المستندات المالية؟",
        type: "radio",
        Options: ["نعم", "لا"],
        required: true,
      },
      {
        id: 8.1,
        label: "إذا كانت الإجابة نعم، يرجى ذكر الأدوات المستخدمة",
        type: "text",
        required: false,
        dependsOn: { questionId: 8, value: "نعم" },
      },
      {
        id: 9,
        label: "كيف تؤكد على أهمية النزاهة والشفافية في تعاملاتك المالية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 10,
        label:
          "ما هي أهم التوصيات التي تعتقد أنه يجب رفعها إلى الإدارة المالية لتحسين عمليات إدارة الإيرادات؟",
        type: "text",
        required: true,
      },
      {
        id: 11,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "نائب مسؤول قسم الإيرادات": {
    title: "نائب مسؤول قسم الإيرادات",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label:
          "كيف تقيم قدرتك على متابعة عمليات استلام الإيرادات وتوثيقها بشكل دوري؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 2,
        label:
          "ما هي الاستراتيجيات التي تتبعها للإشراف على الفرق الفرعية (إيرادات مشاريع - منح - تبرعات - توثيق) قسم الإيرادات؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label:
          "ما هي الطرق التي تستخدمها لتنظيم وحفظ الإيصالات والسجلات المالية؟",
        type: "radio",
        Options: [
          "نظام إلكتروني (مثل Excel أو ERP)",
          "الأرشفة الورقية",
          "كليهما",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 4,
        label:
          "ما هي الإجراءات التي تتبعها لضمان تحديث الأرشيف الإلكتروني بانتظام؟",
        type: "textarea",
        required: true,
      },
      {
        id: 5,
        label: "كيف تقوم بإعداد التقارير المرحلية والملخصات الدورية؟",
        type: "radio",
        Options: [
          "جمع البيانات من الفرق",
          "استخدام نماذج جاهزة",
          "تحليل البيانات بشكل دوري",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 6,
        label:
          "ما هي النقاط الأساسية التي تركز عليها عند كتابة محاضر الاجتماعات؟",
        type: "radio",
        Options: [
          "الوقت والتاريخ",
          "القرارات المتخذة",
          "التوصيات والملاحظات",
          "جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 7,
        label: "كيف تساهم في رصد التحديات المالية واقتراح الحلول المناسبة؟",
        type: "textarea",
        required: true,
      },
      {
        id: 8,
        label:
          "في حالة غياب المسؤول، كيف تضمن استمرارية عمل اللجنة دون انقطاع؟",
        type: "radio",
        Options: [
          "توزيع المهام على الفرق",
          "التواصل مع الإدارات الأخرى",
          "متابعة الأعمال اليومية",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 8.1,
        label: "كيف تؤكد على أهمية الشفافية والدقة في جميع الإجراءات المالية؟",
        type: "textarea",
        required: true,
      },
      {
        id: 9,
        label: "كيف تقيم قدرتك على العمل مع فرق متعددة ومهام متوازية؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "نائب مسؤول التسجيل": {
    title: "نائب مسؤول التسجيل",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label: "ما مدى خبرتك في تنظيم عمليات التسجيل بشكل عام؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 2,
        label: "إذا واجهتك مشكلة في عمل فريق الاستفسارات، كيف تتعامل معها؟",
        type: "radio",
        Options: [
          "أرفع المشكلة إلى المسؤول",
          "أتحدث مع الفريق لمحاولة حلها",
          "أبحث عن حلول خارجية",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 3,
        label:
          "ما هي الطريقة التي تتبعها لمراجعة البيانات المدخلة للتأكد من دقتها؟",
        type: "radio",
        Options: [
          "مراجعة يدوية",
          "استخدام برامج خاصة",
          "التعاون مع زملاء الفريق",
          "لم أشارك في ذلك سابقاً",
        ],
        required: true,
      },
      {
        id: 4,
        label: "كيف تقيم قدرتك على متابعة المشكلات ورفعها للمسؤول؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 5,
        label:
          "ما هي العناصر الأساسية التي تفضل تضمينها في التقارير الأسبوعية؟",
        type: "text",
        required: true,
      },
      {
        id: 6,
        label:
          "في حال كنت بحاجة للتنسيق مع قسم الإيرادات، ما هي الطريقة التي تفضلها؟",
        type: "radio",
        Options: [
          "الاجتماعات الدورية",
          "البريد الإلكتروني",
          "الاتصال المباشر",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 7,
        label: "ما هي إستراتيجيتك لحفظ النسخ الاحتياطية من البيانات بشكل دوري؟",
        type: "radio",
        Options: [
          "التخزين السحابي",
          "التخزين المحلي",
          "إعداد نسخ احتياطية تلقائية",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 8,
        label: "كيف تتعامل مع المهام المتعددة في مواقف الضغط العالي؟",
        type: "text",
        required: true,
      },
      {
        id: 9,
        label: "كيف تصف دقتك في العمل؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "كيف تعزز روح العمل الجماعي داخل فريق التسجيل؟",
        type: "text",
        required: true,
      },
      {
        id: 11,
        label: "ما هي الطريقة المفضلة لديك لحفظ النسخ الاحتياطية من البيانات؟",
        type: "radio",
        Options: [
          "التخزين السحابي (Google Drive، Dropbox)",
          "التخزين المحلي",
          "كلاهما",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 12,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "عضو الاستفسارات": {
    title: "عضو الاستفسارات",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label: "كيف تقيم قدرتك على الرد على استفسارات الطلاب بشكل فعال؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 2,
        label: "إذا كان هناك استفسار غير واضح من طالب، كيف تتعامل معه؟",
        type: "radio",
        Options: [
          "أطلب مزيد من التفاصيل",
          "أقدم ما أعتقد أنه صحيح",
          "أحيل الطالب إلى مسؤول آخر",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 3,
        label: "كيف تتعامل مع مشكلة يواجهها أحد المستفيدين؟",
        type: "radio",
        Options: [
          "أحاول حلها بنفسي",
          "أبلغ المسؤول",
          "أعطي المستفيد اقتراحات",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 4,
        label:
          "ما هو مدى خبرتك السابقة في خدمة العملاء أو التعامل مع المستفيدين؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 5,
        label: "كيف تقيم مهاراتك في التواصل مع مختلف الشخصيات؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 6,
        label: "كيف يمكنك ضمان رضا المستفيدين عن تجربة التسجيل؟",
        type: "textarea",
        required: true,
      },
      {
        id: 6.1,
        label:
          "في حال كانت المشكلة تتطلب خبرة أعلى، هل ستقوم بإحالتها للمسؤول؟",
        type: "radio",
        Options: [
          "نعم، على الفور",
          "لا، سأحاول حلها بنفسي أولاً",
          "أحياناً حسب تقديري",
        ],
        required: true,
      },
      {
        id: 7,
        label: "كيف تتعامل مع الاستفسارات الكثيرة في وقت قصير؟",
        type: "radio",
        Options: [
          "أضع أولوية للرد",
          "أعمل بجد أكبر",
          "أطلب المساعدة من الزملاء",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 8,
        label: "كيف تصف قدرتك على التعامل مع مواقف صعبة؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 9,
        label:
          "إذا كان بإمكانك تحسين تجربة الاستفسارات، فما هي الفكرة التي ستطرحها؟",
        type: "text",
        required: true,
      },
      {
        id: 10,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },

  "نائب مسؤول قسم المشاريع": {
    title: "نائب مسؤول قسم المشاريع",
    department: "الإدارة المالية",
    questions: [
      {
        id: 1,
        label:
          "كيف تقيم قدرتك على متابعة سير عمل اللجان التابعة للمشاريع بشكل دوري؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 2,
        label:
          "إذا لاحظت أن إحدى الفرق تتأخر عن الخطة الزمنية، ما هو الإجراء الذي ستقوم به؟",
        type: "textarea",
        required: true,
      },
      {
        id: 3,
        label: "ما هي الأدوات التي تفضل استخدامها لتوثيق مراحل تنفيذ المشاريع؟",
        type: "checkbox",
        Options: [
          "Microsoft Word",
          "Google Drive / Sheets",
          "برامج إدارة المشاريع (مثل Trello أو Asana)",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 4,
        label: "كم مرة تقوم بإعداد تقارير دورية عن سير المشاريع؟",
        type: "radio",
        Options: ["أسبوعياً", "شهرياً", "عند الحاجة", "أخرى (يرجى التحديد)"],
        required: true,
      },
      {
        id: 5,
        label: "كيف تضمن دقة التقارير المقدمة لك من اللجان؟",
        type: "radio",
        Options: [
          "مراجعتها بدقة شخصياً",
          "طلب التعديلات اللازمة من الفرق",
          "التواصل مع الأعضاء المعنيين",
          "أخرى (يرجى التحديد)",
        ],
        required: true,
      },
      {
        id: 6,
        label:
          "ما هي العناصر الأساسية التي تضعها في اعتبارك عند كتابة محاضر الاجتماعات؟",
        type: "text",
        required: true,
      },
      {
        id: 7,
        label: "كيف تتعامل مع التحديات التي قد تواجه المشاريع؟",
        type: "radio",
        Options: [
          "بحث النقاط الضعيفة مع الفرق",
          "تقديم اقتراحات للحلول",
          "رفع الموضوع للمسؤول",
          "جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 8,
        label:
          "إذا كان أحد الفرق يواجه صعوبة في تنفيذ عمله، كيف يمكنك مساعدتهم؟",
        type: "text",
        required: true,
      },
      {
        id: 9,
        label: "كيف تقيم قدرتك على التعامل مع مهام متعددة في وقت واحد؟",
        type: "radio",
        Options: ["1 - ضعيف", "2 - متوسط", "3 - جيد", "4 - ممتاز"],
        required: true,
      },
      {
        id: 10,
        label: "كيف تعزز روح الفريق والالتزام بالعمل التطوعي بين أعضاء الفريق؟",
        type: "radio",
        Options: [
          "تنظيم أنشطة مشتركة",
          "تقديم الدعم والتوجيه",
          "الاحتفاء بالإنجازات والمساهمات",
          "جميع ما سبق",
        ],
        required: true,
      },
      {
        id: 11,
        label: "إضافة أو تعليق",
        type: "text",
        required: false,
      },
    ],
  },
};

export default jobsData;
